In [1]:
import numpy as np
import pandas as pd

In [2]:
dic={'A':np.arange(0,13,4),
    'B':np.arange(1,14,4),
    'C':np.arange(2,15,4),
    'D':np.arange(3,16,4)}
df=pd.DataFrame(dic)
df

    A   B   C   D
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [3]:
df.to_csv('My_output',index=False)

In [4]:
pd.read_csv('My_output')

    A   B   C   D
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [5]:
df.to_excel('Excel_Sample.xlsx',sheet_name='NewSheet')

In [7]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='NewSheet')

   Unnamed: 0   A   B   C   D
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [11]:
data=pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [13]:
type(data)

list

In [14]:
data[0].head()

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"

In [15]:
from sqlalchemy import create_engine

In [16]:
engine=create_engine('sqlite:///:memory:')

In [22]:
df.to_sql('New_Table',engine)

In [24]:
sqldf=pd.read_sql('New_Table',con=engine)
sqldf

   index   A   B   C   D
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15